Revit 2026 API

# ApplicationNewFamilyInstanceCreationData(FamilySymbol, IListXYZ) Method

---
**Namespace:** Autodesk.Revit.Creation**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public FamilyInstanceCreationData NewFamilyInstanceCreationData(
	FamilySymbol symbol,
	IList<XYZ> adaptivePoints
)
```
```vb
Public Function NewFamilyInstanceCreationData (
	symbol As FamilySymbol,
	adaptivePoints As IList(Of XYZ)
) As FamilyInstanceCreationData
```
```cpp
public:
FamilyInstanceCreationData^ NewFamilyInstanceCreationData(
	FamilySymbol^ symbol,
	IList<XYZ^>^ adaptivePoints
)
```
```fsharp
member NewFamilyInstanceCreationData :
        symbol : FamilySymbol *
        adaptivePoints : IList<XYZ> -> FamilyInstanceCreationData
```

#### Parameters

symbol FamilySymbol

adaptivePoints IListXYZ

#### Return Value

FamilyInstanceCreationData

#### Reference

Application Class

NewFamilyInstanceCreationData Overload

Autodesk.Revit.Creation Namespace